### Задача 1

Загрузите таблицу city_temperature.csv в pandas DataFrame. При помощи встроенных методов библиотеки Pandas найдите количество стран, среднее значение температуры в которых бывает больше 100 градусов по Фаренгейту.

**Циклы и условия использовать нельзя**.

Описание базы:
---------------------------------
**Region** - регион

**Country** - страна 

**State** - штат (если есть) 

**Month** - месяц 

**Day** - день 

**Year** - год 

**AvgTemperature** - средняя температура в Фаренгейтах

Ссылка на базу: https://drive.google.com/file/d/1bLiz_81Kb4pMryEalRe66jS38_F6vwMX/view?usp=sharing

**Решение:**

In [ ]:
import pandas as pd         # Подключаем библиотеку pandas

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/NU/04 Pandas/city_temperature.csv')           # Создаем dataFrame и присваеваем его переменной data
data.head()                                                                              # Посмотрим заголовок (первые 5 строк) данного dataFrame

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [ ]:
# Создаем маску
temp_mask = data['AvgTemperature'] > 100

# Так как в задаче требуется найти только количество стран(без штатов и городов), то нужно применить метод unique

print (data.Country[temp_mask].unique())         # Применяем маску и выводим на печать список стран 
print ("\nКоличество стран со средней температурой больше 100 градусов: ",data.Country[temp_mask].unique().size)

data.Country[data.AvgTemperature > 100].unique()

data[data.AvgTemperature >100].Country.nunique()

['Egypt' 'Guinea-Bissau' 'Nigeria' 'India' 'Pakistan' 'Turkmenistan'
 'Cyprus' 'Bahrain' 'Kuwait' 'Oman' 'Qatar' 'Saudi Arabia'
 'United Arab Emirates' 'Mexico' 'US']

Количество стран со средней температурой больше 100 градусов:  15

15

### Задача 2

Найдите медиану столбца AvgTemperature при помощи встроенных методов библиотеки Pandas.

**Решение:**

In [ ]:
# С помощью метода median, найдем медиану в заданном столбце

median_temp = data.AvgTemperature.median()
print ("Медиана в столбце AvgTemperature равна:", median_temp)

# Или без использования переменной вывести сразу в функцию print
print ("Медиана в столбце AvgTemperature равна:",data.AvgTemperature.median())

Медиана в столбце AvgTemperature равна: 62.5
Медиана в столбце AvgTemperature равна: 62.5

### Задача 3

Найдите число записей в базе данных для первого января 1995 года или первого января 2018 года при помощи масок.

**Решение:**

In [ ]:
# Создаем маску по заданным параметрам и сохраняем ее в переменную
one_january_1995 = data[(data.Day == 1) & (data.Month == 1) & (data.Year == 1995)]

# Можно вывести общее число записей относящиеся к 1 января 1995 года
print ("Число записей в базе данных для первого января 1995 года: ",one_january_1995.size)

# Вывести отсортированный dataFrame
one_january_1995

Число записей в базе данных для первого января 1995 года:  2544

                Region                   Country  ...  Year AvgTemperature
0               Africa                   Algeria  ...  1995           64.2
9266            Africa                   Burundi  ...  1995          -99.0
13809           Africa                     Benin  ...  1995           81.2
23075           Africa  Central African Republic  ...  1995           75.3
32341           Africa                     Congo  ...  1995           79.9
...                ...                       ...  ...   ...            ...
2862480  North America                        US  ...  1995           19.6
2871745  North America                        US  ...  1995           23.8
2881010  North America                        US  ...  1995           10.1
2890275  North America                        US  ...  1995            8.8
2899540  North America                        US  ...  1995           77.4

[318 rows x 8 columns]

In [ ]:
# Так же можно найти число записей в таблице с помощью метода groupby и count. Которые дадут общий результат

one_january_2018 = data[(data.Day == 1) & (data.Month == 1) & (data.Year == 2018)].groupby(['Year', 'Month', 'Day']).count()

# С помощью метода sum можно найти общее количество элементов 
print ("Число записей в базе данных для первого января 2018 года. Не включая столбцы: Год, Месяц, День: ",one_january_2018.sum().sum())

# Выведем таблицу
one_january_2018

Число записей в базе данных для первого января 2018 года. Не включая столбцы: Год, Месяц, День:  1329

                Region  Country  State  City  AvgTemperature
Year Month Day
2018 1     1       294      294    153   294             294

### Задание 4

**Решение:**

Получите список всех уникальных значений стран в таблице при помощи встроенных методов.

In [ ]:
# C помощью метода unique найдем все уникальные значения в столбце Country
print (data.Country.unique())

# Так же можно узнать количество уникальных значений стран
print ("\nКоличество уникальных стран в столбце Country: ",data.Country.unique().size)
print ("\n")

# Или другим способом. Вывести список сортированный по алфавиту. И подсчет количества с помощью метода nunique

sort_temp = data.Country.sort_values().unique()
print (sort_temp)

#Количетво уникальных значений
data.Country.nunique()

['Algeria' 'Burundi' 'Benin' 'Central African Republic' 'Congo' 'Egypt'
 'Ethiopia' 'Gabon' 'Gambia' 'Guinea' 'Guinea-Bissau' 'Ivory Coast'
 'Kenya' 'Morocco' 'Madagascar' 'Mauritania' 'Malawi' 'Mozambique'
 'Namibia' 'Nigeria' 'Senegal' 'Sierra Leone' 'South Africa' 'Togo'
 'Tunisia' 'Tanzania' 'Uganda' 'Zambia' 'Bangladesh' 'China' 'Hong Kong'
 'India' 'Indonesia' 'Japan' 'Kazakhstan' 'Kyrgyzstan' 'Laos' 'Malaysia'
 'Mongolia' 'Myanmar (Burma)' 'Nepal' 'North Korea' 'Pakistan'
 'Philippines' 'Singapore' 'South Korea' 'Sri Lanka' 'Taiwan' 'Tajikistan'
 'Thailand' 'Turkmenistan' 'Uzbekistan' 'Vietnam' 'Australia'
 'New Zealand' 'Albania' 'Austria' 'Belarus' 'Belgium' 'Bulgaria'
 'Croatia' 'Cyprus' 'Czech Republic' 'Denmark' 'Finland' 'France'
 'Germany' 'Georgia' 'Greece' 'Hungary' 'Iceland' 'Ireland' 'Italy'
 'Latvia' 'Macedonia' 'The Netherlands' 'Norway' 'Poland' 'Portugal'
 'Romania' 'Russia' 'Serbia-Montenegro' 'Slovakia' 'Spain' 'Sweden'
 'Switzerland' 'Ukraine' 'United Kingdom' 'Yugoslavia' 'Bahrain' 'Israel'
 'Jordan' 'Kuwait' 'Lebanon' 'Oman' 'Qatar' 'Saudi Arabia' 'Syria'
 'Turkey' 'United Arab Emirates' 'Canada' 'Mexico' 'Argentina' 'Bahamas'
 'Bermuda' 'Belize' 'Bolivia' 'Barbados' 'Brazil' 'Colombia' 'Costa Rica'
 'Cuba' 'Dominican Republic' 'Equador' 'Guatemala' 'Guyana' 'Haiti'
 'Honduras' 'Nicaragua' 'Panama' 'Peru' 'Suriname' 'Uruguay' 'Venezuela'
 'US']

Количество уникальных стран в столбце Country:  125


['Albania' 'Algeria' 'Argentina' 'Australia' 'Austria' 'Bahamas' 'Bahrain'
 'Bangladesh' 'Barbados' 'Belarus' 'Belgium' 'Belize' 'Benin' 'Bermuda'
 'Bolivia' 'Brazil' 'Bulgaria' 'Burundi' 'Canada'
 'Central African Republic' 'China' 'Colombia' 'Congo' 'Costa Rica'
 'Croatia' 'Cuba' 'Cyprus' 'Czech Republic' 'Denmark' 'Dominican Republic'
 'Egypt' 'Equador' 'Ethiopia' 'Finland' 'France' 'Gabon' 'Gambia'
 'Georgia' 'Germany' 'Greece' 'Guatemala' 'Guinea' 'Guinea-Bissau'
 'Guyana' 'Haiti' 'Honduras' 'Hong Kong' 'Hungary' 'Iceland' 'India'
 'Indonesia' 'Ireland' 'Israel' 'Italy' 'Ivory Coast' 'Japan' 'Jordan'
 'Kazakhstan' 'Kenya' 'Kuwait' 'Kyrgyzstan' 'Laos' 'Latvia' 'Lebanon'
 'Macedonia' 'Madagascar' 'Malawi' 'Malaysia' 'Mauritania' 'Mexico'
 'Mongolia' 'Morocco' 'Mozambique' 'Myanmar (Burma)' 'Namibia' 'Nepal'
 'New Zealand' 'Nicaragua' 'Nigeria' 'North Korea' 'Norway' 'Oman'
 'Pakistan' 'Panama' 'Peru' 'Philippines' 'Poland' 'Portugal' 'Qatar'
 'Romania' 'Russia' 'Saudi Arabia' 'Senegal' 'Serbia-Montenegro'
 'Sierra Leone' 'Singapore' 'Slovakia' 'South Africa' 'South Korea'
 'Spain' 'Sri Lanka' 'Suriname' 'Sweden' 'Switzerland' 'Syria' 'Taiwan'
 'Tajikistan' 'Tanzania' 'Thailand' 'The Netherlands' 'Togo' 'Tunisia'
 'Turkey' 'Turkmenistan' 'US' 'Uganda' 'Ukraine' 'United Arab Emirates'
 'United Kingdom' 'Uruguay' 'Uzbekistan' 'Venezuela' 'Vietnam'
 'Yugoslavia' 'Zambia']

125

### Задача 5
При помощи переводчика или при помощи своих знаний переведите названия столбцов на русский язык. Замените в таблице английские названия столбцов на русские

**Решение:**

In [ ]:
data.head()    # Еще раз посмотрим изначальный dataFrame (названия столбцов по английски)

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [ ]:
# Присваеваем переменной colm список названий столбцов
colm = data.columns.tolist()

# Меняем список 
colm = ['Регион', 'Страна', 'Штат', 'Город', 'Месяц', 'День', 'Год', 'Средняя температура в Фаренгейтах']

#Присваеваем новое значание столбцов
data.columns = colm

data.head()    # Выводим на экран

   Регион   Страна Штат  ... День   Год  Средняя температура в Фаренгейтах
0  Africa  Algeria  NaN  ...    1  1995                               64.2
1  Africa  Algeria  NaN  ...    2  1995                               49.4
2  Africa  Algeria  NaN  ...    3  1995                               48.8
3  Africa  Algeria  NaN  ...    4  1995                               46.4
4  Africa  Algeria  NaN  ...    5  1995                               47.9

[5 rows x 8 columns]